Repository: BravoBaldo/Translations
Catalog: Node-RED/OmegaT_NodeRed/OmegaT_NodeRed-level2.tmx
Source language: en_us
Languages: it_it

source: If a node has multiple outputs it can be hard to follow the logic if it is not clear on what condition a message may be sent from a particular output.
it_it: Se un nodo ha più output, può essere difficile seguirne la logica se non è chiaro in base a quali condizioni un messaggio può essere inviato da un particolare output.

source: If a node needs to log something to the console, it can use one of the follow functions:
it_it: Se un nodo deve registrare qualcosa nella console, può utilizzare una delle seguenti funzioni:

source: If a piece of state information is only needed by nodes on a particular tab, you should use flow-scoped rather than global.
it_it: Se un'informazione sullo stato è necessaria solo per i nodi di una scheda specifica, è consigliabile utilizzare lo "scope" del flusso anziché quello globale.

source: If it is not a `Bearer` type token, then the full value of the `Authorization` header will be passed to the function, containing both type and value.
it_it: Se non si tratta di un token di tipo `Bearer`, alla funzione verrà passato il valore completo dell'header `Authorization`, contenente sia il tipo che il valore.

source: If no update is required, the function can return `undefined` or `null`.
it_it: Se non è richiesto alcun aggiornamento, la funzione può restituire `undefined` o `null`.

source: If set to 0, the default, no timeout is applied.
it_it: Se impostato su 0 (il default), non viene applicato alcun timeout.

source: If the `https` property is a function, it can be used to return the options object.
it_it: Se la proprietà `https` è una funzione, può essere utilizzata per restituire l'oggetto opzioni.

source: If the context store requires asynchronous access, the `get` and `set` functions require an extra callback parameter.
it_it: Se il "context store" richiede l'accesso asincrono, le funzioni `get` e `set` richiedono un parametro di callback aggiuntivo.

source: If the flow needs to be able to reference that id value later on, it can use a Change node to copy the value to another property that will not get overwritten.
it_it: Se il flusso deve poter fare riferimento a quel valore ID in un secondo momento, può utilizzare un nodo Change per copiare il valore in un'altra proprietà che non verrà sovrascritta.

source: If the function encounters an error that should halt the current flow, it should return nothing.
it_it: Se la funzione riscontra un errore che dovrebbe interrompere il flusso corrente, non dovrebbe restituire nulla.

source: If the function needs to perform an asynchronous action before sending a message it cannot return the message at the end of the function.
it_it: Se la funzione deve eseguire un'azione asincrona prima di inviare un messaggio, non può restituire il messaggio alla fine della funzione.

source: If the function returns `null`, then no message is passed on and the flow ends.
it_it: Se la funzione restituisce `null`, non viene trasmesso alcun messaggio e il flusso termina.

source: If the subflow creates a connection to a remote system, each instance will create its own connection.
it_it: Se il `Subflow` crea una connessione a un sistema remoto, ogni istanza creerà la propria connessione.

source: If there is a node that has more than one output port, aligning the branched flow vertically makes it easy to compare and contrast the flows.
it_it: Se un nodo ha più di una porta di uscita, l'allineamento verticale del flusso ramificato semplifica il confronto e il contrasto dei flussi.

source: If there is more than one output, an array of messages can be returned by the function to send to the outputs.
it_it: Se è presente più di un output, la funzione può restituire un array di messaggi da inviare agli output.

source: If there is no logger configured to capture those levels, they will not be seen.
it_it: Se non è configurato alcun logger per acquisire questi livelli, non saranno visibili.

source: If you are building an HTTP API backend, each tab could represent a separate type of resource the API accesses.
it_it: Se si sta sviluppando un backend API HTTP, ogni scheda potrebbe rappresentare un tipo separato di risorsa a cui l'API accede.

source: If you are looking for more information about using Node-RED, the [User Guide](https://nodered.org/docs/user-guide/) and [Cookbook](https://cookbook.nodered.org/) are good resources to help you get started.
it_it: Per maggiori informazioni sull'utilizzo di Node-RED, la [Guida Utente](https://nodered.org/docs/user-guide/) e il [Cookbook](https://cookbook.nodered.org/) sono ottime risorse per iniziare.

source: If you are sharing a flow with others, it will help them understand what it is doing and how it works.
it_it: Se si condivide un flusso con altri, questo li aiuterà a capire cosa fa e come funziona.

source: If you are using Node-RED 1.1.0 or later, you can use the command:
it_it: Se si usa Node-RED 1.1.0 o versioni successive, si può usare il comando:

source: If you can identify separate logical components of your application, consider putting them on separate tabs.
it_it: Se si riescono a identificare componenti logici separati dell'applicazione, valutare la possibilità di inserirli in schede separate.

source: If you consider the Link nodes as providing APIs between the different tabs, then a good choice of naming scheme will be needed.
it_it: Se si considera che i nodi Link forniscono API tra le diverse schede, sarà necessario scegliere uno schema di denominazione appropriato.

source: If you do use asynchronous callback code in your functions then you may need to tidy up any outstanding requests, or close any connections, whenever the flow gets re-deployed.
it_it: Se si utilizza codice di callback asincrono nelle funzioni, potrebbe essere necessario riordinare le richieste in sospeso o chiudere le connessioni ogni volta che il flusso viene ridistribuito.

source: If you have a question, suggestion or just want to say hello, there are various places you can do so:
it_it: Se c'è una domanda, un suggerimento o si vuole semplicemente salutare, ci sono diversi posti dove lo si può fare:

source: If you have developers with different roles or specialisations, consider how that may affect how your flows are organised.
it_it: Se si hanno sviluppatori con ruoli o specializzazioni diverse, considerare come ciò potrebbe influire sull'organizzazione dei flussi.

source: If you install it separately, you would use the command `node-red-admin`.
it_it: Se lo si installa separatamente, si utilizzerà il comando `node-red-admin`.

source: If you run as a system service then it may appear in the system log.
it_it: Se si esegue come servizio di sistema, potrebbe apparire nel log di sistema.

source: If you run under an app like PM2 it will have it's own way for showing logs.
it_it: Se si esegue un'app come PM2, questa mostrerà i log in modo autonomo.

source: If you start using a command line - that is the console where logging will appear.
it_it: Se si avvia tramite riga di comando, questa è la console in cui apparirà il logging.

source: If you want to install `node-red-admin` separately, you can install it as a global module with:
it_it: Per installare `node-red-admin` separatamente, è possibile farlo come modulo globale con:

source: In a visual programming environment like Node-RED, the documentation can take a number of forms.
it_it: In un ambiente di programmazione visuale come Node-RED, la documentazione può assumere diverse forme.

source: In all cases, you will get back the hashed version of your password which you can then paste into your settings file.
it_it: In entrambi i casi, si otterrà la versione hash della password, che si potrà incollare nel file delle impostazioni.

source: In any programming language, a vital part of creating easy-to-maintain code is to ensure it is also well documented.
it_it: In qualsiasi linguaggio di programmazione, un aspetto fondamentale per creare codice di facile manutenzione è assicurarsi che sia anche ben documentato.

source: In order to add more in depth documentation, something more is needed.
it_it: Per aggiungere una documentazione più approfondita, è necessario qualcosa in più.

source: In some cases, it is desirable to allow everyone some level of access.
it_it: In alcuni casi, è consigliabile consentire a tutti un certo livello di accesso.

source: In some cases, these smaller sections may be candidates for moving to subflows that will reduce the visual complexity of the flow.
it_it: In alcuni casi, queste sezioni più piccole potrebbero essere candidate per essere spostate in `Subflow` che ne ridurranno la complessità visiva.

source: In some circumstances you may need to use your own authentication tokens and not use those generated by Node-RED.
it_it: In alcune circostanze potrebbe essere necessario utilizzare i propri token di autenticazione anziché quelli generati da Node-RED.

source: In the Function node there are three predefined variables that can be used to access context:
it_it: Nel nodo Funzione sono presenti tre variabili predefinite utilizzabili per accedere al contesto:

source: In the MQTT example, you could first configure the node to publish to `${MY_TOPIC}`.
it_it: Nell'esempio MQTT, si potrebbe prima configurare il nodo per la pubblicazione su `${MY_TOPIC}`.

source: In the following example, `msg1`, `msg2`, `msg3` will be sent to the first output.
it_it: Nell'esempio seguente, `msg1`, `msg2`, `msg3` verranno inviati al primo output.

source: In the following figure, some of the nodes are arranged vertically to imply a relationship between them.
it_it: Nella figura seguente, alcuni nodi sono disposti verticalmente per suggerire una relazione tra loro.

source: In this case, any missing values are set to `null`.
it_it: In questo caso, tutti i valori mancanti vengono impostati su `null`.

source: Indices and tables
it_it: Indici e tabelle

source: Inline Comments
it_it: Commenti in Linea

source: Install the separate [`node-red-admin` command-line tool](../node-red-admin) and use the command:
it_it: Installare lo [strumento da riga di comando `node-red-admin`](../node-red-admin) separato e usare il comando:

source: Installation
it_it: Installazione

source: Instead, it must make use of the `node.send()` function, passing in the message(s) to be sent.
it_it: Invece, deve utilizzare la funzione `node.send()`, passando il/i messaggio/i da inviare.

source: It also gets displayed in the Debug sidebar with every message.
it_it: Viene inoltre visualizzato nella barra laterale Debug con ogni messaggio.

source: It doesn’t currently work for fields that are exposed as checkboxes or other custom UI elements.
it_it: Al momento non funziona per i campi esposti come "checkbox" o altri elementi personalizzati dell'Interfaccia Utente.

source: It is also useful where a flow provides an external API of some sort - providing as much detail as it needed for other developers to use the API.
it_it: È utile anche quando un flusso fornisce un'API esterna di qualche tipo, fornendo tutti i dettagli necessari per consentire ad altri sviluppatori di utilizzare l'API.

source: It is also very important for Link nodes.
it_it: È molto importante anche per i nodi Link.

source: It is easier to understand the nature of the overall flow if it is visually obvious what smaller sections it is comprised of and how they relate to each other.
it_it: È più facile comprendere la natura del flusso complessivo se è visivamente evidente da quali sezioni più piccole è composto e come queste si relazionano tra loro.

source: It is much easier to manage the merging of changes if they are on separate tabs.
it_it: È molto più facile gestire l'unione delle modifiche se si trovano in schede separate.

source: It is passed the token provided in the request and should return a Promise that resolves with either the authenticated user, or `null` if the token is not valid.
it_it: Viene passato il token fornito nella richiesta e dovrebbe restituire una Promise che si risolve con l'utente autenticato o `null` se il token non è valido.

source: It is possible to configure Node-RED to periodically refresh its HTTPS certificates without having to restart Node-RED.
it_it: È possibile configurare Node-RED per aggiornare periodicamente i suoi certificati HTTPS senza dover riavviare Node-RED.

source: It is possible to provide custom HTTP middleware that will be added in front of all `HTTP In` nodes and, since Node-RED 1.1.0, in front of all admin/editor routes.
it_it: È possibile fornire un middleware HTTP personalizzato che verrà aggiunto davanti a tutti i nodi `HTTP In` e, a partire da Node-RED 1.1.0, davanti a tutte le rotte admin/editor.

source: It is possible to set a timeout for the function node on the Setup tab.
it_it: È possibile impostare un timeout per il nodo Funzione nella scheda "Setup".

source: It might be used to identify the source of the message, or to identify different 'streams' of messages on the same flows.
it_it: Potrebbe essere utilizzato per identificare l'origine del messaggio o per identificare diversi 'stream' di messaggi sugli stessi flussi.

source: It must be the URL of your Node-RED editor with `/auth/strategy/callback` added to the path.
it_it: Deve essere l'URL dell'editor Node-RED con `/auth/strategy/callback` aggiunto al path.

source: It must call `done` with a user profile as the second argument if the user is valid.
it_it: Deve chiamare `done` con un profilo utente come secondo argomento se l'utente è valido.

source: It takes the same arrangement of messages as that can be returned, as described in the previous sections.
it_it: Accetta la stessa disposizione dei messaggi che può essere restituita, come descritto nelle sezioni precedenti.

source: It then uses that id to query a database to find a matching record.
it_it: Utilizza quindi tale ID per interrogare un database e trovare un record corrispondente.

source: It would do this if the message contains something that is not otherwise cloneable, or for performance reasons to minimise the overhead of sending messages:
it_it: Lo faceva se il messaggio conteneva qualcosa che non sarebbe altrimenti clonabile, o per motivi di prestazioni per ridurre al minimo il sovraccarico dell'invio dei messaggi:

source: Join the [Node-RED Forum](https://discourse.nodered.org)
it_it: Unirsi al [Node-RED Forum](https://discourse.nodered.org)

source: Join us on [Slack](http://nodered.org/slack/)
it_it: Unirsi a [Slack](http://nodered.org/slack/)

source: Keeping it on a single tab can help do that.
it_it: Mantenere tutto in un'unica scheda può aiutare a raggiungere questo obiettivo.

source: Laying out flows
it_it: Disposizione dei Flussi

source: Link nodes cannot be used in the middle of a flow, where messages are passed over the link and then return when the other flow completes.
it_it: I "Nodi Link" non possono essere utilizzati nel mezzo di un flusso, dove i messaggi vengono trasmessi tramite il link e poi restituiti al completamento dell'altro flusso.

source: Loading additional modules
it_it: Caricamento di moduli aggiuntivi

source: Logging events
it_it: Logging di eventi

source: Making reusable flows
it_it: Creazione di Flussi Riutilizzabili

source: Managing state information
it_it: Gestione delle Informazioni sullo Stato

source: Modules loaded from your settings file must be installed in the same directory as the settings file.
it_it: I moduli caricati dal file delle impostazioni devono essere installati nella stessa directory di tale file.

source: More complete documentation can be added at the node, group or tab level
it_it: È possibile aggiungere una documentazione più completa a livello di nodo, gruppo o scheda.

source: More information about Context within Node-RED is available [here](/docs/user-guide/context).
it_it: Ulteriori informazioni su Context in Node-RED sono disponibili [qui](/docs/user-guide/context).

source: Most nodes have a `name` property that can be used to customise the label they display in the workspace.
it_it: La maggior parte dei nodi ha una proprietà `name` utilizzabile per personalizzare l'etichetta visualizzata nell'area di lavoro.

source: Most nodes will expect to work with `msg.payload` and that will guide most of the choices you make.
it_it: La maggior parte dei nodi si aspetta di lavorare con `msg.payload` e questo guiderà la maggior parte delle scelte effettuate.

source: Moving commonly used parts into subflows can help reduce the visual complexity of the flow.
it_it: Spostare le parti di uso comune in `Subflow` può aiutare a ridurre la complessità visiva del flusso.

source: Multiple Messages
it_it: Messaggi Multipli

source: Multiple Outputs
it_it: Output Multipli

source: Multiple context stores
it_it: "Context Store" multipli

source: Naming nodes
it_it: Nomi dei Nodi

source: Node-RED allows you to quickly start developing applications by dragging in nodes and wiring them together to create flows.
it_it: Node-RED consente di iniziare rapidamente a sviluppare applicazioni trascinando i nodi e collegandoli tra loro per creare flussi.

source: Node-RED authentication modules are available for both [Twitter](https://www.npmjs.com/package/node-red-auth-twitter) and [GitHub](https://www.npmjs.com/package/node-red-auth-github).
it_it: I moduli di autenticazione Node-RED sono disponibili sia per [Twitter](https://www.npmjs.com/package/node-red-auth-twitter) che per [GitHub](https://www.npmjs.com/package/node-red-auth-github).

source: Node-RED provides the Catch and Status nodes as ways of building flows that can respond to errors.
it_it: Node-RED fornisce i nodi Catch e Status come strumenti per creare flussi in grado di rispondere agli errori.

source: Node-RED provides the Context system for managing state within the runtime.
it_it: Node-RED fornisce il sistema Context per la gestione dello stato all'interno del runtime.

source: Node-RED provides two different ways of creating reusable flows - Links nodes and Subflows.
it_it: Node-RED offre due diversi modi per creare flussi riutilizzabili: "Nodi Link" e "Subflow".

source: Node-Red User Guide
it_it: Guida Utente di Node-Red

source: Note that the passwords are securely hashed using the bcrypt algorithm.
it_it: Si noti che le password vengono sottoposte a hash sicuro utilizzando l'algoritmo bcrypt.

source: Note: the function node automatically clears any outstanding timeouts or interval timers whenever it is stopped or re-deployed.
it_it: Nota: il nodo funzione cancella automaticamente eventuali timeout o timer di intervallo in sospeso ogni volta che viene arrestato o "re-deployed".

source: OAuth/OpenID based authentication
it_it: Autenticazione basata su OAuth/OpenID

source: On a Pi the install script adds a `node-red-log` command that will display the log.
it_it: Su un Pi, lo script di installazione aggiunge un comando `node-red-log` che visualizzerà il log.

source: One approach is to put everything under the payload.
it_it: Un approccio consiste nel collocare tutto nel payload.

source: One called `admin` who has permission to do everything within the editor and has a password of `password`.
it_it: Uno chiamato `admin`, che ha l'autorizzazione a eseguire tutte le operazioni all'interno dell'editor e ha la password `password`.

source: One pattern for doing that is by setting `msg.topic` on every message passed to the subflow.
it_it: Un modo per farlo è impostare `msg.topic` su ogni messaggio passato al `Subflow`.

source: Or you may want to separate the flows based on function - so all lighting-related flows go on one tab and heating on another.
it_it: Oppure si potrebbero separare i flussi in base alla funzione, in modo che tutti i flussi relativi all'illuminazione siano in una scheda e quelli relativi al riscaldamento in un'altra.

source: Or, *since Node-RED 1.1.0*, you can add code to the `On Stop` tab (previously labelled `Close`) in the node's edit dialog.
it_it: Oppure, *a partire da Node-RED 1.1.0*, è possibile aggiungere codice al "tab" `On Stop` (in precedenza denominato `Close`) nella finestra di dialogo di modifica del nodo.

source: Or, locate the directory Node-RED has been installed to and use the command:
it_it: Oppure, individuare la directory in cui è stato installato Node-RED e usare il comando:

source: Other commands
it_it: Altri comandi

source: Other modules and functions
it_it: Altri moduli e funzioni

source: Other nodes may attach their own properties to the message, and they should be described in their documentation.
it_it: Altri nodi possono associare le proprie proprietà al messaggio, che devono essere descritte nella loro documentazione.

source: Other places to get help
it_it: Altri posti dove trovare aiuto

source: Other possible uses would be to add additional layers of security or request verification to the routes.
it_it: Altri possibili utilizzi potrebbero essere l'aggiunta di ulteriori livelli di sicurezza o la verifica delle richieste alle route.

source: Over time, that can lead to a mess of nodes and wires that make it hard to find particular parts of the flow.
it_it: Col tempo, questo può portare a un caos di nodi e fili che rende difficile trovare parti specifiche del flusso.

source: Passport attempts to standardize the user profile object, so most strategies provide this property.
it_it: Passport tenta di standardizzare l'oggetto "profile" utente, quindi la maggior parte delle strategie fornisce questa proprietà.

source: Placing them close to the parts of the flow they correspond to can help, but you should take care not cause your flows to become overcrowded.
it_it: Posizionarli vicino alle parti del flusso a cui corrispondono può essere utile, ma è necessario fare attenzione a non sovraffollare i flussi.

source: Prior to Node-RED 0.14, users could have one of two permissions:
it_it: Prima di Node-RED 0.14, gli utenti potevano avere una delle due autorizzazioni:

source: Project-Id-Version: Node-Red 2025 Report-Msgid-Bugs-To: POT-Creation-Date: 2025-10-11 08:31+0200 PO-Revision-Date: YEAR-MO-DA HO:MI+ZONE Last-Translator: FULL NAME <EMAIL@ADDRESS> Language: it Language-Team: it <LL@li.org> Plural-Forms: nplurals=2; plural=(n != 1); MIME-Version: 1.0 Content-Type: text/plain; charset=utf-8 Content-Transfer-Encoding: 8bit Generated-By: Babel 2.17.0
it_it: [fuzzy]Project-Id-Version: Node-Red 2025 Report-Msgid-Bugs-To: POT-Creation-Date: 2025-10-11 08:31+0200 PO-Revision-Date: YEAR-MO-DA HO:MI+ZONE Last-Translator: FULL NAME <EMAIL@ADDRESS> Language: it Language-Team: it <LL@li.org> Plural-Forms: nplurals=2; plural=(n != 1); MIME-Version: 1.0 Content-Type: text/plain; charset=utf-8 Content-Transfer-Encoding: 8bit Generated-By: Babel 2.17.0

source: Putting some thought into how to structure your flows at the start of any development project can help keep them organised and make them easier to maintain.
it_it: Pensare a come strutturare i flussi all'inizio di qualsiasi progetto di sviluppo può aiutare a mantenerli organizzati e a semplificarne la manutenzione.

source: Rather than hardcode users into the settings file, it is also possible to plug in custom code to authenticate users.
it_it: Anziché codificare gli utenti nel file delle impostazioni, è anche possibile inserire codice personalizzato per autenticarli.

source: Refer to the strategy's own documentation for what it requires.
it_it: Per informazioni sui requisiti della strategia, fare riferimento alla documentazione specifica.

source: Refreshing HTTPS certificates
it_it: Aggiornamento dei certificati HTTPS

source: Returning a number or string will result in an error.
it_it: Restituire un numero o una stringa genererà un errore.

source: Running code on start
it_it: Esecuzione del codice all'avvio
